Revit 2027 API
ExternalResourceSubFolder.FolderName Property
 Folder displayed name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FolderName { get; set; }
Public Property FolderName As String
	Get
	Set
public:
property String^ FolderName {
	String^ get ();
	void set (String^ value);
}
member FolderName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace